БухЭксп/Catalogs/CW_ОтслеживаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОтслеживаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСлежения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыСлежения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавлятьВКарточку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыОборудованияНаСлежении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыОборудованияНаСлежении</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСлежения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОтслеживаемоеОборудование/Forms/ФормаПривязкиОборудования/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	Параметры.Свойство("Грузоперевозка",		Грузоперевозка);
	Параметры.Свойство("Представление",			Представление);
	Параметры.Свойство("ДатаГрузоперевозки",	ДатаГрузоперевозки);
	Параметры.Свойство("ОтслеживаемоеОборудование",ОтслеживаемоеОборудование);
	
	ТаблицаОтслеживаемогоОборудования.Очистить();
	
	Оборудование = Справочники.CW_Оборудование.ПолучитьОборудованиеПоНаименованию(Представление);
	Если Не Оборудование.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ОтслеживаемоеОборудование.Ссылка КАК ОтслеживаемоеОборудование,
		               |	CW_ОтслеживаемоеОборудование.НачалоСлежения КАК НачалоСлежения,
		               |	CW_ОтслеживаемоеОборудование.ОкончаниеСлежения КАК ОкончаниеСлежения,
		               |	CW_СтатусыОборудованияНаСлеженииСрезПоследних.Статус КАК Статус
		               |ИЗ
		               |	РегистрСведений.CW_СтатусыОборудованияНаСлежении.СрезПоследних КАК CW_СтатусыОборудованияНаСлеженииСрезПоследних,
		               |	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
		               |ГДЕ
		               |	CW_ОтслеживаемоеОборудование.Оборудование = &Оборудование
		               |	И &ДатаПеревозки МЕЖДУ CW_ОтслеживаемоеОборудование.НачалоСлежения И ВЫБОР
		               |			КОГДА CW_ОтслеживаемоеОборудование.ОкончаниеСлежения = ДАТАВРЕМЯ(1, 1, 1)
		               |				ТОГДА КОНЕЦПЕРИОДА(&ДатаПеревозки, ДЕНЬ)
		               |			ИНАЧЕ КОНЕЦПЕРИОДА(CW_ОтслеживаемоеОборудование.ОкончаниеСлежения, ДЕНЬ)
		               |		КОНЕЦ
		               |	И ВЫБОР
		               |			КОГДА &ВыбраноОтслеживаемоеОборудование
		               |				ТОГДА CW_ОтслеживаемоеОборудование.Ссылка = &ОтслеживаемоеОборудование
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Грузоперевозка",			Грузоперевозка);
		Запрос.УстановитьПараметр("ДатаПеревозки", 			ДатаГрузоперевозки);
		Запрос.УстановитьПараметр("Оборудование",  			Оборудование);
		
		Запрос.УстановитьПараметр("ВыбраноОтслеживаемоеОборудование",  	ЗначениеЗаполнено(ОтслеживаемоеОборудование));
		Запрос.УстановитьПараметр("ОтслеживаемоеОборудование",  			ОтслеживаемоеОборудование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока =  ТаблицаОтслеживаемогоОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаОтслеживаемогоОборудования.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбрано отслеживаемое оборудование для подставновки в грузоперевозоку!");
		Возврат;
	Иначе
		ПродолжитьВыборОборудования(ТекущаяСтрока);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтслеживаемогоОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПродолжитьВыборОборудования(ВыбраннаяСтрока);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродолжитьВыборОборудования(ВыбраннаяСтрока);
	
	ВыбранноеОборудование = ПродолжитьВыборОборудованияНаСервере(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(ВыбранноеОборудование);
	
КонецПроцедуры

&НаСервере
Функция  ПродолжитьВыборОборудованияНаСервере(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаОтслеживаемогоОборудования.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат СтрокаТекущая.ОтслеживаемоеОборудование;
	
КонецФункции
